In [2]:
import sys
sys.path.append("./data3")
import USdata

In [5]:
USdata.population

{'Alabama': 4833722,
 'Alaska': 735132,
 'Arizona': 6626624,
 'Arkansas': 2959373,
 'California': 38332521,
 'Colorado': 5268367,
 'Connecticut': 3596080,
 'Delaware': 925749,
 'Florida': 19552860,
 'Georgia': 9992167,
 'Hawaii': 1404054,
 'Idaho': 1612136,
 'Illinois': 12882135,
 'Indiana': 6570902,
 'Iowa': 3090416,
 'Kansas': 2893957,
 'Kentucky': 4395295,
 'Louisiana': 4625470,
 'Maine': 1328302,
 'Maryland': 5928814,
 'Massachusetts': 6692824,
 'Michigan': 9895622,
 'Minnesota': 5420380,
 'Mississippi': 2991207,
 'Missouri': 6021988,
 'Montana': 1015165,
 'Nebraska': 1868516,
 'Nevada': 2790136,
 'New Hampshire': 1323459,
 'New Jersey': 8899339,
 'New Mexico': 2085287,
 'New York': 19651127,
 'North Carolina': 9848060,
 'North Dakota': 723393,
 'Ohio': 11570808,
 'Oklahoma': 3850568,
 'Oregon': 3930065,
 'Pennsylvania': 12773801,
 'Rhode Island': 1051511,
 'South Carolina': 4774839,
 'South Dakota': 844877,
 'Tennessee': 6495978,
 'Texas': 26448193,
 'Utah': 2900872,
 'Vermont': 626630,
 'Virginia': 8260405,
 'Washington': 6971406,
 'West Virginia': 1854304,
 'Wisconsin': 5742713,
 'Wyoming': 582658}

In [6]:
USdata.area

{'Alabama': 52420,
 'Alaska': 665384,
 'Arizona': 113990,
 'Arkansas': 53179,
 'California': 163695,
 'Colorado': 104094,
 'Connecticut': 5543,
 'Delaware': 2489,
 'Florida': 65758,
 'Georgia': 59425,
 'Hawaii': 10932,
 'Idaho': 83569,
 'Illinois': 57914,
 'Indiana': 36420,
 'Iowa': 56273,
 'Kansas': 82278,
 'Kentucky': 40408,
 'Louisiana': 52378,
 'Maine': 35380,
 'Maryland': 12406,
 'Massachusetts': 10554,
 'Michigan': 96714,
 'Minnesota': 86936,
 'Mississippi': 48432,
 'Missouri': 69707,
 'Montana': 147040,
 'Nebraska': 77348,
 'Nevada': 110572,
 'New Hampshire': 9349,
 'New Jersey': 8723,
 'New Mexico': 121590,
 'New York': 54555,
 'North Carolina': 53819,
 'North Dakota': 70698,
 'Ohio': 44826,
 'Oklahoma': 69899,
 'Oregon': 98379,
 'Pennsylvania': 46054,
 'Rhode Island': 1545,
 'South Carolina': 32020,
 'South Dakota': 77116,
 'Tennessee': 42144,
 'Texas': 268596,
 'Utah': 84897,
 'Vermont': 9616,
 'Virginia': 42775,
 'Washington': 71298,
 'West Virginia': 24230,
 'Wisconsin': 65496,
 'Wyoming': 97813}

In [19]:
density = [round(USdata.population[i]/ USdata.area[i],3) for i in USdata.population.keys()]
density.sort()

In [21]:
print(density)

[1.105, 5.957, 6.904, 10.232, 10.956, 17.15, 19.291, 24.157, 25.234, 34.169, 35.173, 37.544, 39.948, 50.612, 54.918, 55.088, 55.649, 58.133, 61.761, 62.349, 65.165, 76.529, 86.39, 87.68, 88.309, 92.211, 97.778, 98.468, 102.318, 108.773, 128.435, 141.562, 149.121, 154.138, 168.148, 180.42, 182.985, 193.113, 222.436, 234.17, 258.127, 277.366, 297.346, 360.208, 371.936, 477.899, 634.15, 648.761, 680.59, 1020.215]

In [29]:
import random

In [80]:
sample = [(random.random(),random.random()) for i in range(10000)]
estimated_pi = sum([x**2 + y**2 <=1 for x,y in sample])/10000 * 4

In [81]:
estimated_pi

3.1332

In [64]:
estimated_pi > 3.1 and estimated_pi < 3.2

True

In [85]:
2**1 * 3**2 * 13 ** 1 * 173 ** 1 * 499**1

20200518

In [ ]:
[[2, 1], [3, 2], [13, 1], [173, 1], [499, 1]]

In [91]:
li = [1,2,3,4,5,6,7,8]
li[i for i in range(2)]

SyntaxError: invalid syntax (<ipython-input-91-f0aa0642b257>, line 2)

In [92]:
import pandas as pd

In [104]:
df_1 = pd.read_csv("no1_scored.csv",encoding="shift-jis")
df_2 = pd.read_csv("score2.csv",encoding="shift-jis")
df_3 = pd.read_csv("score.csv")#,encoding="shift-jis")

In [101]:
df_1.head()

,学籍番号,採点 倉又,採点 松井,第1回点数,コンサイ1,コンサイ2,姓,名,学科,last name,first name,faculty,ハンドル名,学内メールアドレス,個人メールアドレス,携帯メールアドレス
0,14_08217,NaN,○,20.0,NaN,NaN,高木,映紀,社会工学科,Takagi,Eiki,Social Engineering,aKI,takagi.e.aa@m.titech.ac.jp,NaN,登録あり
1,17B00805,NaN,○,30.0,NaN,NaN,荒山,慧,経営工学系,Arayama,Kei,Undergraduate major in Industrial Engineering ...,NaN,arayama.k.ab@m.titech.ac.jp,NaN,NaN
2,17B02649,NaN,NaN,NaN,NaN,NaN,大池,優士,数学系,Oike,Yushi,Undergraduate major in Mathematics,NaN,oike.y.aa@m.titech.ac.jp,NaN,登録あり
3,17B08184,NaN,○,30.0,○,○,菅原,大資,経営工学系,Sugawara,Daisuke,Undergraduate major in Industrial Engineering ...,NaN,sugawara.d.aa@m.titech.ac.jp,登録あり,NaN
4,17B08860,NaN,○,30.0,NaN,NaN,高井,雄也,経営工学系,Takai,Yuya,Undergraduate major in Industrial Engineering ...,NaN,takai.y.ac@m.titech.ac.jp,NaN,NaN

In [110]:
df_2 = df_2.iloc[:,[0,-2,-1]]

In [109]:
df_3.columns=["学籍番号","第3回通常","第3回応用"]

In [115]:
[0] + list(range(6,16))

[0, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

In [144]:
df = pd.merge(pd.merge(df_1.iloc[:-1,[0,6,7,8,9,10,11,12,13,14,15,3]],df_2,on="学籍番号",how="outer"),df_3,on="学籍番号",how="outer")

In [146]:
df.to_csv("score3.csv",encoding="shift-jis")

In [153]:
df_1 = pd.read_csv("copycehck_Density.csv",index_col=0)
df_2 = pd.read_csv("copycehck_MonteCarlo.csv",index_col=0)
df_3 = pd.read_csv("copycehck_PrimeFactorization.csv",index_col=0)

In [162]:
df_1.stack().reset_index()

       ID_min  level_1         0
0     1408217  1700805  0.172414
1     1408217  1708184 -0.130890
2     1408217  1708860  0.717647
3     1408217  1806604  0.701149
4     1408217  1808589  0.528796
...       ...      ...       ...
1886  1913814  1941704  0.464789
1887  1913814  1950040  0.419643
1888  1941348  1941704  0.698492
1889  1941348  1950040  0.590476
1890  1941704  1950040  0.850746

[1891 rows x 3 columns]

In [163]:
df_2.stack().reset_index()

       ID_min  level_1         0
0     1408217  1700805  0.655462
1     1408217  1708184  0.450704
2     1408217  1708860  0.723849
3     1408217  1801216  0.413127
4     1408217  1806604  0.285266
...       ...      ...       ...
1948  1913814  1941704  0.342193
1949  1913814  1950040  0.630252
1950  1941348  1941704  0.415929
1951  1941348  1950040  0.478261
1952  1941704  1950040  0.411371

[1953 rows x 3 columns]